In [1]:
import pandas as pd

In [5]:
df = pd.read_csv("sample_data.csv")

In [11]:
df.head()

   id first_name last_name                         email  gender
0   1   Fidelity    Lincey  flincey0@theglobeandmail.com  Female
1   2      Rheta   Yurasov        ryurasov1@linkedin.com  Female
2   3     Bendix    Paszak             bpaszak2@imdb.com    Male
3   4        Cly    Cossar             ccossar3@1und1.de    Male
4   5       Raul     Setch             rsetch4@zdnet.com    Male

In [13]:
df.head(3)

   id first_name last_name                         email  gender
0   1   Fidelity    Lincey  flincey0@theglobeandmail.com  Female
1   2      Rheta   Yurasov        ryurasov1@linkedin.com  Female
2   3     Bendix    Paszak             bpaszak2@imdb.com    Male

In [15]:
df.tail()

    id first_name    last_name                         email  gender
15  16    Katrine        Tefft         ktefftf@earthlink.net  Female
16  17  Cleopatra       Deason     cdeasong@surveymonkey.com  Female
17  18       Esra       Struis           estruish@utexas.edu    Male
18  19       Edan      Ordidge     eordidgei@dagondesign.com    Male
19  20      Emili  Leppingwell  eleppingwellj@purevolume.com  Female

In [17]:
df.tail(3)

    id first_name    last_name                         email  gender
17  18       Esra       Struis           estruish@utexas.edu    Male
18  19       Edan      Ordidge     eordidgei@dagondesign.com    Male
19  20      Emili  Leppingwell  eleppingwellj@purevolume.com  Female

In [19]:
type(df)

pandas.core.frame.DataFrame

In [23]:
list(df.columns)

['id', 'first_name', 'last_name', 'email', 'gender']

In [25]:
df['first_name']

0      Fidelity
1         Rheta
2        Bendix
3           Cly
4          Raul
5         Jabez
6        Cybill
7      Celestyn
8       Dierdre
9       Georges
10        Eydie
11       Gerrie
12       Renaud
13        Berry
14        Pammy
15      Katrine
16    Cleopatra
17         Esra
18         Edan
19        Emili
Name: first_name, dtype: object

In [27]:
df['gender']

0     Female
1     Female
2       Male
3       Male
4       Male
5       Male
6     Female
7     Female
8     Female
9       Male
10    Female
11    Female
12      Male
13    Female
14    Female
15    Female
16    Female
17      Male
18      Male
19    Female
Name: gender, dtype: object

In [33]:
type(df['gender']) # series is equivalent to a list

pandas.core.series.Series

In [35]:
list(df['gender'])

['Female',
 'Female',
 'Male',
 'Male',
 'Male',
 'Male',
 'Female',
 'Female',
 'Female',
 'Male',
 'Female',
 'Female',
 'Male',
 'Female',
 'Female',
 'Female',
 'Female',
 'Male',
 'Male',
 'Female']

In [37]:
df[['gender']]

    gender
0   Female
1   Female
2     Male
3     Male
4     Male
5     Male
6   Female
7   Female
8   Female
9     Male
10  Female
11  Female
12    Male
13  Female
14  Female
15  Female
16  Female
17    Male
18    Male
19  Female

In [39]:
type(df[['gender']])

pandas.core.frame.DataFrame

In [45]:
df[['first_name', 'gender']]

   first_name  gender
0    Fidelity  Female
1       Rheta  Female
2      Bendix    Male
3         Cly    Male
4        Raul    Male
5       Jabez    Male
6      Cybill  Female
7    Celestyn  Female
8     Dierdre  Female
9     Georges    Male
10      Eydie  Female
11     Gerrie  Female
12     Renaud    Male
13      Berry  Female
14      Pammy  Female
15    Katrine  Female
16  Cleopatra  Female
17       Esra    Male
18       Edan    Male
19      Emili  Female

In [49]:
df.dtypes #object here is string

id             int64
first_name    object
last_name     object
email         object
gender        object
dtype: object

In [53]:
df1 = pd.read_excel("sample_data.xls")

In [55]:
type(df1)

pandas.core.frame.DataFrame

In [57]:
df1.dtypes

First Name    object
Last Name     object
Gender        object
Age            int64
Email         object
dtype: object

In [59]:
df1.columns

Index(['First Name', 'Last Name', 'Gender', 'Age', 'Email'], dtype='object')

In [61]:
df1[['First Name', 'Gender']]

   First Name  Gender
0       Chloe  Female
1        Tara  Female
2        Adam    Male
3      Kellan    Male
4        Dale    Male
5     Chelsea  Female
6     Freddie    Male
7        Jack    Male
8        Paul    Male
9      Amelia  Female
10   Adrianna  Female
11     Julian    Male
12      Daisy  Female
13    Valeria  Female
14     Alexia  Female
15    Preston    Male
16      Amber  Female
17     Sydney  Female
18    Jessica  Female
19      Spike    Male